##################################################################

# Created by write_sdc on Sat Aug 30 16:15:25 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions ss0p95v125c -library saed32lvt_ss0p95v125c
set_load -pin_load 0.95619 [get_ports {final_out[2047]}]
set_load -pin_load 0.95619 [get_ports {final_out[2046]}]
set_load -pin_load 0.95619 [get_ports {final_out[2045]}]
set_load -pin_load 0.95619 [get_ports {final_out[2044]}]
set_load -pin_load 0.95619 [get_ports {final_out[2043]}]
set_load -pin_load 0.95619 [get_ports {final_out[2042]}]
set_load -pin_load 0.95619 [get_ports {final_out[2041]}]
set_load -pin_load 0.95619 [get_ports {final_out[2040]}]
set_load -pin_load 0.95619 [get_ports {final_out[2039]}]
set_load -pin_load 0.95619 [get_ports {final_out[2038]}]
set_load -pin_load 0.95619 [get_ports {final_out[2037]}]
set_load -pin_load 0.95619 [get_ports {final_out[2036]}]
set_load -pin_load 0.95619 [get_ports {final_out[2035]}]
set_load -pin_load 0.95619 [get_ports {final_out[2034]}]
set_load -pin_load 0.95619 [get_ports {final_out[2033]}]
set_load -pin_load 0.95619 [get_ports {final_out[2032]}]
set_load -pin_load 0.95619 [get_ports {final_out[2031]}]
set_load -pin_load 0.95619 [get_ports {final_out[2030]}]
set_load -pin_load 0.95619 [get_ports {final_out[2029]}]
set_load -pin_load 0.95619 [get_ports {final_out[2028]}]
set_load -pin_load 0.95619 [get_ports {final_out[2027]}]
set_load -pin_load 0.95619 [get_ports {final_out[2026]}]
set_load -pin_load 0.95619 [get_ports {final_out[2025]}]
set_load -pin_load 0.95619 [get_ports {final_out[2024]}]
set_load -pin_load 0.95619 [get_ports {final_out[2023]}]
set_load -pin_load 0.95619 [get_ports {final_out[2022]}]
set_load -pin_load 0.95619 [get_ports {final_out[2021]}]
set_load -pin_load 0.95619 [get_ports {final_out[2020]}]
set_load -pin_load 0.95619 [get_ports {final_out[2019]}]
set_load -pin_load 0.95619 [get_ports {final_out[2018]}]
set_load -pin_load 0.95619 [get_ports {final_out[2017]}]
set_load -pin_load 0.95619 [get_ports {final_out[2016]}]
set_load -pin_load 0.95619 [get_ports {final_out[2015]}]
set_load -pin_load 0.95619 [get_ports {final_out[2014]}]
set_load -pin_load 0.95619 [get_ports {final_out[2013]}]
set_load -pin_load 0.95619 [get_ports {final_out[2012]}]
set_load -pin_load 0.95619 [get_ports {final_out[2011]}]
set_load -pin_load 0.95619 [get_ports {final_out[2010]}]
set_load -pin_load 0.95619 [get_ports {final_out[2009]}]
set_load -pin_load 0.95619 [get_ports {final_out[2008]}]
set_load -pin_load 0.95619 [get_ports {final_out[2007]}]
set_load -pin_load 0.95619 [get_ports {final_out[2006]}]
set_load -pin_load 0.95619 [get_ports {final_out[2005]}]
set_load -pin_load 0.95619 [get_ports {final_out[2004]}]
set_load -pin_load 0.95619 [get_ports {final_out[2003]}]
set_load -pin_load 0.95619 [get_ports {final_out[2002]}]
set_load -pin_load 0.95619 [get_ports {final_out[2001]}]
set_load -pin_load 0.95619 [get_ports {final_out[2000]}]
set_load -pin_load 0.95619 [get_ports {final_out[1999]}]
set_load -pin_load 0.95619 [get_ports {final_out[1998]}]
set_load -pin_load 0.95619 [get_ports {final_out[1997]}]
set_load -pin_load 0.95619 [get_ports {final_out[1996]}]
set_load -pin_load 0.95619 [get_ports {final_out[1995]}]
set_load -pin_load 0.95619 [get_ports {final_out[1994]}]
set_load -pin_load 0.95619 [get_ports {final_out[1993]}]
set_load -pin_load 0.95619 [get_ports {final_out[1992]}]
set_load -pin_load 0.95619 [get_ports {final_out[1991]}]
set_load -pin_load 0.95619 [get_ports {final_out[1990]}]
set_load -pin_load 0.95619 [get_ports {final_out[1989]}]
set_load -pin_load 0.95619 [get_ports {final_out[1988]}]
set_load -pin_load 0.95619 [get_ports {final_out[1987]}]
set_load -pin_load 0.95619 [get_ports {final_out[1986]}]
set_load -pin_load 0.95619 [get_ports {final_out[1985]}]
set_load -pin_load 0.95619 [get_ports {final_out[1984]}]
set_load -pin_load 0.95619 [get_ports {final_out[1983]}]
set_load -pin_load 0.95619 [get_ports {final_out[1982]}]
set_load -pin_load 0.95619 [get_ports {final_out[1981]}]
set_load -pin_load 0.95619 [get_ports {final_out[1980]}]
set_load -pin_load 0.95619 [get_ports {final_out[1979]}]
set_load -pin_load 0.95619 [get_ports {final_out[1978]}]
set_load -pin_load 0.95619 [get_ports {final_out[1977]}]
set_load -pin_load 0.95619 [get_ports {final_out[1976]}]
set_load -pin_load 0.95619 [get_ports {final_out[1975]}]
set_load -pin_load 0.95619 [get_ports {final_out[1974]}]
set_load -pin_load 0.95619 [get_ports {final_out[1973]}]
set_load -pin_load 0.95619 [get_ports {final_out[1972]}]
set_load -pin_load 0.95619 [get_ports {final_out[1971]}]
set_load -pin_load 0.95619 [get_ports {final_out[1970]}]
set_load -pin_load 0.95619 [get_ports {final_out[1969]}]
set_load -pin_load 0.95619 [get_ports {final_out[1968]}]
set_load -pin_load 0.95619 [get_ports {final_out[1967]}]
set_load -pin_load 0.95619 [get_ports {final_out[1966]}]
set_load -pin_load 0.95619 [get_ports {final_out[1965]}]
set_load -pin_load 0.95619 [get_ports {final_out[1964]}]
set_load -pin_load 0.95619 [get_ports {final_out[1963]}]
set_load -pin_load 0.95619 [get_ports {final_out[1962]}]
set_load -pin_load 0.95619 [get_ports {final_out[1961]}]
set_load -pin_load 0.95619 [get_ports {final_out[1960]}]
set_load -pin_load 0.95619 [get_ports {final_out[1959]}]
set_load -pin_load 0.95619 [get_ports {final_out[1958]}]
set_load -pin_load 0.95619 [get_ports {final_out[1957]}]
set_load -pin_load 0.95619 [get_ports {final_out[1956]}]
set_load -pin_load 0.95619 [get_ports {final_out[1955]}]
set_load -pin_load 0.95619 [get_ports {final_out[1954]}]
set_load -pin_load 0.95619 [get_ports {final_out[1953]}]
set_load -pin_load 0.95619 [get_ports {final_out[1952]}]
set_load -pin_load 0.95619 [get_ports {final_out[1951]}]
set_load -pin_load 0.95619 [get_ports {final_out[1950]}]
set_load -pin_load 0.95619 [get_ports {final_out[1949]}]
set_load -pin_load 0.95619 [get_ports {final_out[1948]}]
set_load -pin_load 0.95619 [get_ports {final_out[1947]}]
set_load -pin_load 0.95619 [get_ports {final_out[1946]}]
set_load -pin_load 0.95619 [get_ports {final_out[1945]}]
set_load -pin_load 0.95619 [get_ports {final_out[1944]}]
set_load -pin_load 0.95619 [get_ports {final_out[1943]}]
set_load -pin_load 0.95619 [get_ports {final_out[1942]}]
set_load -pin_load 0.95619 [get_ports {final_out[1941]}]
set_load -pin_load 0.95619 [get_ports {final_out[1940]}]
set_load -pin_load 0.95619 [get_ports {final_out[1939]}]
set_load -pin_load 0.95619 [get_ports {final_out[1938]}]
set_load -pin_load 0.95619 [get_ports {final_out[1937]}]
set_load -pin_load 0.95619 [get_ports {final_out[1936]}]
set_load -pin_load 0.95619 [get_ports {final_out[1935]}]
set_load -pin_load 0.95619 [get_ports {final_out[1934]}]
set_load -pin_load 0.95619 [get_ports {final_out[1933]}]
set_load -pin_load 0.95619 [get_ports {final_out[1932]}]
set_load -pin_load 0.95619 [get_ports {final_out[1931]}]
set_load -pin_load 0.95619 [get_ports {final_out[1930]}]
set_load -pin_load 0.95619 [get_ports {final_out[1929]}]
set_load -pin_load 0.95619 [get_ports {final_out[1928]}]
set_load -pin_load 0.95619 [get_ports {final_out[1927]}]
set_load -pin_load 0.95619 [get_ports {final_out[1926]}]
set_load -pin_load 0.95619 [get_ports {final_out[1925]}]
set_load -pin_load 0.95619 [get_ports {final_out[1924]}]
set_load -pin_load 0.95619 [get_ports {final_out[1923]}]
set_load -pin_load 0.95619 [get_ports {final_out[1922]}]
set_load -pin_load 0.95619 [get_ports {final_out[1921]}]
set_load -pin_load 0.95619 [get_ports {final_out[1920]}]
set_load -pin_load 0.95619 [get_ports {final_out[1919]}]
set_load -pin_load 0.95619 [get_ports {final_out[1918]}]
set_load -pin_load 0.95619 [get_ports {final_out[1917]}]
set_load -pin_load 0.95619 [get_ports {final_out[1916]}]
set_load -pin_load 0.95619 [get_ports {final_out[1915]}]
set_load -pin_load 0.95619 [get_ports {final_out[1914]}]
set_load -pin_load 0.95619 [get_ports {final_out[1913]}]
set_load -pin_load 0.95619 [get_ports {final_out[1912]}]
set_load -pin_load 0.95619 [get_ports {final_out[1911]}]
set_load -pin_load 0.95619 [get_ports {final_out[1910]}]
set_load -pin_load 0.95619 [get_ports {final_out[1909]}]
set_load -pin_load 0.95619 [get_ports {final_out[1908]}]
set_load -pin_load 0.95619 [get_ports {final_out[1907]}]
set_load -pin_load 0.95619 [get_ports {final_out[1906]}]
set_load -pin_load 0.95619 [get_ports {final_out[1905]}]
set_load -pin_load 0.95619 [get_ports {final_out[1904]}]
set_load -pin_load 0.95619 [get_ports {final_out[1903]}]
set_load -pin_load 0.95619 [get_ports {final_out[1902]}]
set_load -pin_load 0.95619 [get_ports {final_out[1901]}]
set_load -pin_load 0.95619 [get_ports {final_out[1900]}]
set_load -pin_load 0.95619 [get_ports {final_out[1899]}]
set_load -pin_load 0.95619 [get_ports {final_out[1898]}]
set_load -pin_load 0.95619 [get_ports {final_out[1897]}]
set_load -pin_load 0.95619 [get_ports {final_out[1896]}]
set_load -pin_load 0.95619 [get_ports {final_out[1895]}]
set_load -pin_load 0.95619 [get_ports {final_out[1894]}]
set_load -pin_load 0.95619 [get_ports {final_out[1893]}]
set_load -pin_load 0.95619 [get_ports {final_out[1892]}]
set_load -pin_load 0.95619 [get_ports {final_out[1891]}]
set_load -pin_load 0.95619 [get_ports {final_out[1890]}]
set_load -pin_load 0.95619 [get_ports {final_out[1889]}]
set_load -pin_load 0.95619 [get_ports {final_out[1888]}]
set_load -pin_load 0.95619 [get_ports {final_out[1887]}]
set_load -pin_load 0.95619 [get_ports {final_out[1886]}]
set_load -pin_load 0.95619 [get_ports {final_out[1885]}]
set_load -pin_load 0.95619 [get_ports {final_out[1884]}]
set_load -pin_load 0.95619 [get_ports {final_out[1883]}]
set_load -pin_load 0.95619 [get_ports {final_out[1882]}]
set_load -pin_load 0.95619 [get_ports {final_out[1881]}]
set_load -pin_load 0.95619 [get_ports {final_out[1880]}]
set_load -pin_load 0.95619 [get_ports {final_out[1879]}]
set_load -pin_load 0.95619 [get_ports {final_out[1878]}]
set_load -pin_load 0.95619 [get_ports {final_out[1877]}]
set_load -pin_load 0.95619 [get_ports {final_out[1876]}]
set_load -pin_load 0.95619 [get_ports {final_out[1875]}]
set_load -pin_load 0.95619 [get_ports {final_out[1874]}]
set_load -pin_load 0.95619 [get_ports {final_out[1873]}]
set_load -pin_load 0.95619 [get_ports {final_out[1872]}]
set_load -pin_load 0.95619 [get_ports {final_out[1871]}]
set_load -pin_load 0.95619 [get_ports {final_out[1870]}]
set_load -pin_load 0.95619 [get_ports {final_out[1869]}]
set_load -pin_load 0.95619 [get_ports {final_out[1868]}]
set_load -pin_load 0.95619 [get_ports {final_out[1867]}]
set_load -pin_load 0.95619 [get_ports {final_out[1866]}]
set_load -pin_load 0.95619 [get_ports {final_out[1865]}]
set_load -pin_load 0.95619 [get_ports {final_out[1864]}]
set_load -pin_load 0.95619 [get_ports {final_out[1863]}]
set_load -pin_load 0.95619 [get_ports {final_out[1862]}]
set_load -pin_load 0.95619 [get_ports {final_out[1861]}]
set_load -pin_load 0.95619 [get_ports {final_out[1860]}]
set_load -pin_load 0.95619 [get_ports {final_out[1859]}]
set_load -pin_load 0.95619 [get_ports {final_out[1858]}]
set_load -pin_load 0.95619 [get_ports {final_out[1857]}]
set_load -pin_load 0.95619 [get_ports {final_out[1856]}]
set_load -pin_load 0.95619 [get_ports {final_out[1855]}]
set_load -pin_load 0.95619 [get_ports {final_out[1854]}]
set_load -pin_load 0.95619 [get_ports {final_out[1853]}]
set_load -pin_load 0.95619 [get_ports {final_out[1852]}]
set_load -pin_load 0.95619 [get_ports {final_out[1851]}]
set_load -pin_load 0.95619 [get_ports {final_out[1850]}]
set_load -pin_load 0.95619 [get_ports {final_out[1849]}]
set_load -pin_load 0.95619 [get_ports {final_out[1848]}]
set_load -pin_load 0.95619 [get_ports {final_out[1847]}]
set_load -pin_load 0.95619 [get_ports {final_out[1846]}]
set_load -pin_load 0.95619 [get_ports {final_out[1845]}]
set_load -pin_load 0.95619 [get_ports {final_out[1844]}]
set_load -pin_load 0.95619 [get_ports {final_out[1843]}]
set_load -pin_load 0.95619 [get_ports {final_out[1842]}]
set_load -pin_load 0.95619 [get_ports {final_out[1841]}]
set_load -pin_load 0.95619 [get_ports {final_out[1840]}]
set_load -pin_load 0.95619 [get_ports {final_out[1839]}]
set_load -pin_load 0.95619 [get_ports {final_out[1838]}]
set_load -pin_load 0.95619 [get_ports {final_out[1837]}]
set_load -pin_load 0.95619 [get_ports {final_out[1836]}]
set_load -pin_load 0.95619 [get_ports {final_out[1835]}]
set_load -pin_load 0.95619 [get_ports {final_out[1834]}]
set_load -pin_load 0.95619 [get_ports {final_out[1833]}]
set_load -pin_load 0.95619 [get_ports {final_out[1832]}]
set_load -pin_load 0.95619 [get_ports {final_out[1831]}]
set_load -pin_load 0.95619 [get_ports {final_out[1830]}]
set_load -pin_load 0.95619 [get_ports {final_out[1829]}]
set_load -pin_load 0.95619 [get_ports {final_out[1828]}]
set_load -pin_load 0.95619 [get_ports {final_out[1827]}]
set_load -pin_load 0.95619 [get_ports {final_out[1826]}]
set_load -pin_load 0.95619 [get_ports {final_out[1825]}]
set_load -pin_load 0.95619 [get_ports {final_out[1824]}]
set_load -pin_load 0.95619 [get_ports {final_out[1823]}]
set_load -pin_load 0.95619 [get_ports {final_out[1822]}]
set_load -pin_load 0.95619 [get_ports {final_out[1821]}]
set_load -pin_load 0.95619 [get_ports {final_out[1820]}]
set_load -pin_load 0.95619 [get_ports {final_out[1819]}]
set_load -pin_load 0.95619 [get_ports {final_out[1818]}]
set_load -pin_load 0.95619 [get_ports {final_out[1817]}]
set_load -pin_load 0.95619 [get_ports {final_out[1816]}]
set_load -pin_load 0.95619 [get_ports {final_out[1815]}]
set_load -pin_load 0.95619 [get_ports {final_out[1814]}]
set_load -pin_load 0.95619 [get_ports {final_out[1813]}]
set_load -pin_load 0.95619 [get_ports {final_out[1812]}]
set_load -pin_load 0.95619 [get_ports {final_out[1811]}]
set_load -pin_load 0.95619 [get_ports {final_out[1810]}]
set_load -pin_load 0.95619 [get_ports {final_out[1809]}]
set_load -pin_load 0.95619 [get_ports {final_out[1808]}]
set_load -pin_load 0.95619 [get_ports {final_out[1807]}]
set_load -pin_load 0.95619 [get_ports {final_out[1806]}]
set_load -pin_load 0.95619 [get_ports {final_out[1805]}]
set_load -pin_load 0.95619 [get_ports {final_out[1804]}]
set_load -pin_load 0.95619 [get_ports {final_out[1803]}]
set_load -pin_load 0.95619 [get_ports {final_out[1802]}]
set_load -pin_load 0.95619 [get_ports {final_out[1801]}]
set_load -pin_load 0.95619 [get_ports {final_out[1800]}]
set_load -pin_load 0.95619 [get_ports {final_out[1799]}]
set_load -pin_load 0.95619 [get_ports {final_out[1798]}]
set_load -pin_load 0.95619 [get_ports {final_out[1797]}]
set_load -pin_load 0.95619 [get_ports {final_out[1796]}]
set_load -pin_load 0.95619 [get_ports {final_out[1795]}]
set_load -pin_load 0.95619 [get_ports {final_out[1794]}]
set_load -pin_load 0.95619 [get_ports {final_out[1793]}]
set_load -pin_load 0.95619 [get_ports {final_out[1792]}]
set_load -pin_load 0.95619 [get_ports {final_out[1791]}]
set_load -pin_load 0.95619 [get_ports {final_out[1790]}]
set_load -pin_load 0.95619 [get_ports {final_out[1789]}]
set_load -pin_load 0.95619 [get_ports {final_out[1788]}]
set_load -pin_load 0.95619 [get_ports {final_out[1787]}]
set_load -pin_load 0.95619 [get_ports {final_out[1786]}]
set_load -pin_load 0.95619 [get_ports {final_out[1785]}]
set_load -pin_load 0.95619 [get_ports {final_out[1784]}]
set_load -pin_load 0.95619 [get_ports {final_out[1783]}]
set_load -pin_load 0.95619 [get_ports {final_out[1782]}]
set_load -pin_load 0.95619 [get_ports {final_out[1781]}]
set_load -pin_load 0.95619 [get_ports {final_out[1780]}]
set_load -pin_load 0.95619 [get_ports {final_out[1779]}]
set_load -pin_load 0.95619 [get_ports {final_out[1778]}]
set_load -pin_load 0.95619 [get_ports {final_out[1777]}]
set_load -pin_load 0.95619 [get_ports {final_out[1776]}]
set_load -pin_load 0.95619 [get_ports {final_out[1775]}]
set_load -pin_load 0.95619 [get_ports {final_out[1774]}]
set_load -pin_load 0.95619 [get_ports {final_out[1773]}]
set_load -pin_load 0.95619 [get_ports {final_out[1772]}]
set_load -pin_load 0.95619 [get_ports {final_out[1771]}]
set_load -pin_load 0.95619 [get_ports {final_out[1770]}]
set_load -pin_load 0.95619 [get_ports {final_out[1769]}]
set_load -pin_load 0.95619 [get_ports {final_out[1768]}]
set_load -pin_load 0.95619 [get_ports {final_out[1767]}]
set_load -pin_load 0.95619 [get_ports {final_out[1766]}]

set_load -min 29.1342  [get_nets pipeline_chain_20__u_seq2/IN19]
set_resistance 0.000426524  [get_nets pipeline_chain_20__u_seq2/IN19]
set_load -max 7.43383  [get_nets pipeline_chain_20__u_seq2/IN18]
set_load -min 6.85514  [get_nets pipeline_chain_20__u_seq2/IN18]
set_resistance 8.54512e-05  [get_nets pipeline_chain_20__u_seq2/IN18]
set_load -max 7.95516  [get_nets pipeline_chain_20__u_seq2/IN17]
set_load -min 7.3361  [get_nets pipeline_chain_20__u_seq2/IN17]
set_resistance 9.23614e-05  [get_nets pipeline_chain_20__u_seq2/IN17]
set_load -max 7.0833  [get_nets pipeline_chain_20__u_seq2/IN16]
set_load -min 6.53203  [get_nets pipeline_chain_20__u_seq2/IN16]
set_resistance 8.69368e-05  [get_nets pipeline_chain_20__u_seq2/IN16]
set_load -max 7.33267  [get_nets pipeline_chain_20__u_seq2/IN15]
set_load -min 6.76193  [get_nets pipeline_chain_20__u_seq2/IN15]
set_resistance 8.7573e-05  [get_nets pipeline_chain_20__u_seq2/IN15]
set_load -max 5.72448  [get_nets pipeline_chain_20__u_seq2/n184]
set_load -min 5.27902  [get_nets pipeline_chain_20__u_seq2/n184]
set_resistance 7.7327e-05  [get_nets pipeline_chain_20__u_seq2/n184]
set_load -max 6.03663  [get_nets pipeline_chain_20__u_seq2/IN14]
set_load -min 5.56702  [get_nets pipeline_chain_20__u_seq2/IN14]
set_resistance 7.7291e-05  [get_nets pipeline_chain_20__u_seq2/IN14]
set_load -max 6.55149  [get_nets pipeline_chain_20__u_seq2/IN13]
set_load -min 6.0419  [get_nets pipeline_chain_20__u_seq2/IN13]
set_resistance 8.12212e-05  [get_nets pipeline_chain_20__u_seq2/IN13]
set_load -max 6.6503  [get_nets pipeline_chain_20__u_seq2/IN12]
set_load -min 6.13328  [get_nets pipeline_chain_20__u_seq2/IN12]
set_resistance 9.25359e-05  [get_nets pipeline_chain_20__u_seq2/IN12]
set_load -max 8.50093  [get_nets pipeline_chain_20__u_seq2/IN11]
set_load -min 7.83988  [get_nets pipeline_chain_20__u_seq2/IN11]
set_resistance 0.000102133  [get_nets pipeline_chain_20__u_seq2/IN11]
set_load -max 8.72021  [get_nets pipeline_chain_20__u_seq2/IN10]
set_load -min 8.04137  [get_nets pipeline_chain_20__u_seq2/IN10]
set_resistance 0.000110529  [get_nets pipeline_chain_20__u_seq2/IN10]
set_load -max 7.23663  [get_nets pipeline_chain_20__u_seq2/IN9]
set_load -min 6.67357  [get_nets pipeline_chain_20__u_seq2/IN9]
set_resistance 9.13306e-05  [get_nets pipeline_chain_20__u_seq2/IN9]
set_load -max 9.07675  [get_nets pipeline_chain_20__u_seq2/test_se]
set_load -min 8.37088  [get_nets pipeline_chain_20__u_seq2/test_se]
set_resistance 0.000107607  [get_nets pipeline_chain_20__u_seq2/test_se]
set_load -max 9.85079  [get_nets pipeline_chain_20__u_seq2/IN8]
set_load -min 9.08431  [get_nets pipeline_chain_20__u_seq2/IN8]
set_resistance 0.000190013  [get_nets pipeline_chain_20__u_seq2/IN8]
